{"format": "layers-model", "generatedBy": "keras v2.2.4-tf", "convertedBy": "TensorFlow.js Converter v1.2.10.1", "modelTopology": {"keras_version": "2.2.4-tf", "backend": "tensorflow", "model_config": {"class_name": "Sequential", "config": {"name": "sequential_24", "layers": [{"class_name": "Flatten", "config": {"name": "flatten_6", "trainable": true, "batch_input_shape": [null, 7, 7, 1024], "dtype": "float32", "data_format": "channels_last"}}, {"class_name": "Dense", "config": {"name": "dense_70", "trainable": true, "dtype": "float32", "units": 1024, "activation": "relu", "use_bias": true, "kernel_initializer": {"class_name": "GlorotUniform", "config": {"seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}}, {"class_name": "Dense", "config": {"name": "dense_71", "trainable": true, "dtype": "float32", "units": 512, "activation": "relu", "use_bias": true, "kernel_initializer": {"class_name": "GlorotUniform", "config": {"seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}}, {"class_name": "Dense", "config": {"name": "dense_72", "trainable": true, "dtype": "float32", "units": 100, "activation": "relu", "use_bias": true, "kernel_initializer": {"class_name": "GlorotUniform", "config": {"seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}}, {"class_name": "Dense", "config": {"name": "dense_73", "trainable": true, "dtype": "float32", "units": 5, "activation": "softmax", "use_bias": true, "kernel_initializer": {"class_name": "GlorotUniform", "config": {"seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}}]}}, "training_config": {"loss": "sparse_categorical_crossentropy", "metrics": ["accuracy"], "weighted_metrics": null, "sample_weight_mode": null, "loss_weights": null, "optimizer_config": {"class_name": "Adam", "config": {"name": "Adam", "learning_rate": 9.999999747378752e-05, "decay": 0.0, "beta_1": 0.8999999761581421, "beta_2": 0.9990000128746033, "epsilon": 1e-07, "amsgrad": false}}}}, "weightsManifest": [{"paths": ["group1-shard1of50.bin", "group1-shard2of50.bin", "group1-shard3of50.bin", "group1-shard4of50.bin", "group1-shard5of50.bin", "group1-shard6of50.bin", "group1-shard7of50.bin", "group1-shard8of50.bin", "group1-shard9of50.bin", "group1-shard10of50.bin", "group1-shard11of50.bin", "group1-shard12of50.bin", "group1-shard13of50.bin", "group1-shard14of50.bin", "group1-shard15of50.bin", "group1-shard16of50.bin", "group1-shard17of50.bin", "group1-shard18of50.bin", "group1-shard19of50.bin", "group1-shard20of50.bin", "group1-shard21of50.bin", "group1-shard22of50.bin", "group1-shard23of50.bin", "group1-shard24of50.bin", "group1-shard25of50.bin", "group1-shard26of50.bin", "group1-shard27of50.bin", "group1-shard28of50.bin", "group1-shard29of50.bin", "group1-shard30of50.bin", "group1-shard31of50.bin", "group1-shard32of50.bin", "group1-shard33of50.bin", "group1-shard34of50.bin", "group1-shard35of50.bin", "group1-shard36of50.bin", "group1-shard37of50.bin", "group1-shard38of50.bin", "group1-shard39of50.bin", "group1-shard40of50.bin", "group1-shard41of50.bin", "group1-shard42of50.bin", "group1-shard43of50.bin", "group1-shard44of50.bin", "group1-shard45of50.bin", "group1-shard46of50.bin", "group1-shard47of50.bin", "group1-shard48of50.bin", "group1-shard49of50.bin", "group1-shard50of50.bin"], "weights": [{"name": "dense_70/kernel", "shape": [50176, 1024], "dtype": "float32"}, {"name": "dense_70/bias", "shape": [1024], "dtype": "float32"}, {"name": "dense_71/kernel", "shape": [1024, 512], "dtype": "float32"}, {"name": "dense_71/bias", "shape": [512], "dtype": "float32"}, {"name": "dense_72/kernel", "shape": [512, 100], "dtype": "float32"}, {"name": "dense_72/bias", "shape": [100], "dtype": "float32"}, {"name": "dense_73/kernel", "shape": [100, 5], "dtype": "float32"}, {"name": "dense_73/bias", "shape": [5], "dtype": "float32"}]}]}